Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxCan_bf.h
/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP19 */
#define IFX_CAN_N_TX_BRP_TRP19_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP19 */
#define IFX_CAN_N_TX_BRP_TRP19_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP19 */
#define IFX_CAN_N_TX_BRP_TRP19_OFF (19u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP20 */
#define IFX_CAN_N_TX_BRP_TRP20_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP20 */
#define IFX_CAN_N_TX_BRP_TRP20_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP20 */
#define IFX_CAN_N_TX_BRP_TRP20_OFF (20u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP21 */
#define IFX_CAN_N_TX_BRP_TRP21_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP21 */
#define IFX_CAN_N_TX_BRP_TRP21_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP21 */
#define IFX_CAN_N_TX_BRP_TRP21_OFF (21u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP22 */
#define IFX_CAN_N_TX_BRP_TRP22_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP22 */
#define IFX_CAN_N_TX_BRP_TRP22_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP22 */
#define IFX_CAN_N_TX_BRP_TRP22_OFF (22u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP23 */
#define IFX_CAN_N_TX_BRP_TRP23_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP23 */
#define IFX_CAN_N_TX_BRP_TRP23_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP23 */
#define IFX_CAN_N_TX_BRP_TRP23_OFF (23u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP24 */
#define IFX_CAN_N_TX_BRP_TRP24_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP24 */
#define IFX_CAN_N_TX_BRP_TRP24_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP24 */
#define IFX_CAN_N_TX_BRP_TRP24_OFF (24u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP25 */
#define IFX_CAN_N_TX_BRP_TRP25_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP25 */
#define IFX_CAN_N_TX_BRP_TRP25_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP25 */
#define IFX_CAN_N_TX_BRP_TRP25_OFF (25u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP26 */
#define IFX_CAN_N_TX_BRP_TRP26_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP26 */
#define IFX_CAN_N_TX_BRP_TRP26_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP26 */
#define IFX_CAN_N_TX_BRP_TRP26_OFF (26u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP27 */
#define IFX_CAN_N_TX_BRP_TRP27_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP27 */
#define IFX_CAN_N_TX_BRP_TRP27_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP27 */
#define IFX_CAN_N_TX_BRP_TRP27_OFF (27u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP28 */
#define IFX_CAN_N_TX_BRP_TRP28_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP28 */
#define IFX_CAN_N_TX_BRP_TRP28_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP28 */
#define IFX_CAN_N_TX_BRP_TRP28_OFF (28u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP29 */
#define IFX_CAN_N_TX_BRP_TRP29_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP29 */
#define IFX_CAN_N_TX_BRP_TRP29_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP29 */
#define IFX_CAN_N_TX_BRP_TRP29_OFF (29u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP30 */
#define IFX_CAN_N_TX_BRP_TRP30_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP30 */
#define IFX_CAN_N_TX_BRP_TRP30_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP30 */
#define IFX_CAN_N_TX_BRP_TRP30_OFF (30u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP31 */
#define IFX_CAN_N_TX_BRP_TRP31_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP31 */
#define IFX_CAN_N_TX_BRP_TRP31_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP31 */
#define IFX_CAN_N_TX_BRP_TRP31_OFF (31u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR0 */
#define IFX_CAN_N_TX_BAR_AR0_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR0 */
#define IFX_CAN_N_TX_BAR_AR0_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR0 */
#define IFX_CAN_N_TX_BAR_AR0_OFF (0u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR1 */
#define IFX_CAN_N_TX_BAR_AR1_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR1 */
#define IFX_CAN_N_TX_BAR_AR1_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR1 */
#define IFX_CAN_N_TX_BAR_AR1_OFF (1u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR2 */
#define IFX_CAN_N_TX_BAR_AR2_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR2 */
#define IFX_CAN_N_TX_BAR_AR2_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR2 */
#define IFX_CAN_N_TX_BAR_AR2_OFF (2u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR3 */
#define IFX_CAN_N_TX_BAR_AR3_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR3 */
#define IFX_CAN_N_TX_BAR_AR3_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR3 */
#define IFX_CAN_N_TX_BAR_AR3_OFF (3u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR4 */
#define IFX_CAN_N_TX_BAR_AR4_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR4 */
#define IFX_CAN_N_TX_BAR_AR4_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR4 */
#define IFX_CAN_N_TX_BAR_AR4_OFF (4u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR5 */
#define IFX_CAN_N_TX_BAR_AR5_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR5 */
#define IFX_CAN_N_TX_BAR_AR5_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR5 */
#define IFX_CAN_N_TX_BAR_AR5_OFF (5u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR6 */
#define IFX_CAN_N_TX_BAR_AR6_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR6 */
#define IFX_CAN_N_TX_BAR_AR6_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR6 */
#define IFX_CAN_N_TX_BAR_AR6_OFF (6u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR7 */
#define IFX_CAN_N_TX_BAR_AR7_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR7 */
#define IFX_CAN_N_TX_BAR_AR7_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR7 */
#define IFX_CAN_N_TX_BAR_AR7_OFF (7u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR8 */
#define IFX_CAN_N_TX_BAR_AR8_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR8 */
#define IFX_CAN_N_TX_BAR_AR8_MSK (0x1u)

