Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxCan_bf.h
/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR20 */
#define IFX_CAN_N_TX_BCR_CR20_OFF (20u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR21 */
#define IFX_CAN_N_TX_BCR_CR21_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR21 */
#define IFX_CAN_N_TX_BCR_CR21_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR21 */
#define IFX_CAN_N_TX_BCR_CR21_OFF (21u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR22 */
#define IFX_CAN_N_TX_BCR_CR22_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR22 */
#define IFX_CAN_N_TX_BCR_CR22_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR22 */
#define IFX_CAN_N_TX_BCR_CR22_OFF (22u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR23 */
#define IFX_CAN_N_TX_BCR_CR23_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR23 */
#define IFX_CAN_N_TX_BCR_CR23_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR23 */
#define IFX_CAN_N_TX_BCR_CR23_OFF (23u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR24 */
#define IFX_CAN_N_TX_BCR_CR24_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR24 */
#define IFX_CAN_N_TX_BCR_CR24_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR24 */
#define IFX_CAN_N_TX_BCR_CR24_OFF (24u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR25 */
#define IFX_CAN_N_TX_BCR_CR25_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR25 */
#define IFX_CAN_N_TX_BCR_CR25_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR25 */
#define IFX_CAN_N_TX_BCR_CR25_OFF (25u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR26 */
#define IFX_CAN_N_TX_BCR_CR26_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR26 */
#define IFX_CAN_N_TX_BCR_CR26_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR26 */
#define IFX_CAN_N_TX_BCR_CR26_OFF (26u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR27 */
#define IFX_CAN_N_TX_BCR_CR27_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR27 */
#define IFX_CAN_N_TX_BCR_CR27_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR27 */
#define IFX_CAN_N_TX_BCR_CR27_OFF (27u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR28 */
#define IFX_CAN_N_TX_BCR_CR28_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR28 */
#define IFX_CAN_N_TX_BCR_CR28_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR28 */
#define IFX_CAN_N_TX_BCR_CR28_OFF (28u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR29 */
#define IFX_CAN_N_TX_BCR_CR29_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR29 */
#define IFX_CAN_N_TX_BCR_CR29_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR29 */
#define IFX_CAN_N_TX_BCR_CR29_OFF (29u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR30 */
#define IFX_CAN_N_TX_BCR_CR30_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR30 */
#define IFX_CAN_N_TX_BCR_CR30_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR30 */
#define IFX_CAN_N_TX_BCR_CR30_OFF (30u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR31 */
#define IFX_CAN_N_TX_BCR_CR31_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR31 */
#define IFX_CAN_N_TX_BCR_CR31_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR31 */
#define IFX_CAN_N_TX_BCR_CR31_OFF (31u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO0 */
#define IFX_CAN_N_TX_BTO_TO0_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO0 */
#define IFX_CAN_N_TX_BTO_TO0_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO0 */
#define IFX_CAN_N_TX_BTO_TO0_OFF (0u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO1 */
#define IFX_CAN_N_TX_BTO_TO1_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO1 */
#define IFX_CAN_N_TX_BTO_TO1_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO1 */
#define IFX_CAN_N_TX_BTO_TO1_OFF (1u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO2 */
#define IFX_CAN_N_TX_BTO_TO2_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO2 */
#define IFX_CAN_N_TX_BTO_TO2_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO2 */
#define IFX_CAN_N_TX_BTO_TO2_OFF (2u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO3 */
#define IFX_CAN_N_TX_BTO_TO3_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO3 */
#define IFX_CAN_N_TX_BTO_TO3_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO3 */
#define IFX_CAN_N_TX_BTO_TO3_OFF (3u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO4 */
#define IFX_CAN_N_TX_BTO_TO4_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO4 */
#define IFX_CAN_N_TX_BTO_TO4_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO4 */
#define IFX_CAN_N_TX_BTO_TO4_OFF (4u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO5 */
#define IFX_CAN_N_TX_BTO_TO5_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO5 */
#define IFX_CAN_N_TX_BTO_TO5_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO5 */
#define IFX_CAN_N_TX_BTO_TO5_OFF (5u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO6 */
#define IFX_CAN_N_TX_BTO_TO6_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO6 */
#define IFX_CAN_N_TX_BTO_TO6_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO6 */
#define IFX_CAN_N_TX_BTO_TO6_OFF (6u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO7 */
#define IFX_CAN_N_TX_BTO_TO7_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO7 */
#define IFX_CAN_N_TX_BTO_TO7_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO7 */
#define IFX_CAN_N_TX_BTO_TO7_OFF (7u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO8 */
#define IFX_CAN_N_TX_BTO_TO8_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO8 */
#define IFX_CAN_N_TX_BTO_TO8_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO8 */
#define IFX_CAN_N_TX_BTO_TO8_OFF (8u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO9 */
#define IFX_CAN_N_TX_BTO_TO9_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO9 */
#define IFX_CAN_N_TX_BTO_TO9_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO9 */
#define IFX_CAN_N_TX_BTO_TO9_OFF (9u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO10 */
#define IFX_CAN_N_TX_BTO_TO10_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO10 */
#define IFX_CAN_N_TX_BTO_TO10_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO10 */
#define IFX_CAN_N_TX_BTO_TO10_OFF (10u)

