Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxCan_bf.h
/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF2 */
#define IFX_CAN_N_TX_BCF_CF2_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF2 */
#define IFX_CAN_N_TX_BCF_CF2_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF2 */
#define IFX_CAN_N_TX_BCF_CF2_OFF (2u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF3 */
#define IFX_CAN_N_TX_BCF_CF3_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF3 */
#define IFX_CAN_N_TX_BCF_CF3_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF3 */
#define IFX_CAN_N_TX_BCF_CF3_OFF (3u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF4 */
#define IFX_CAN_N_TX_BCF_CF4_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF4 */
#define IFX_CAN_N_TX_BCF_CF4_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF4 */
#define IFX_CAN_N_TX_BCF_CF4_OFF (4u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF5 */
#define IFX_CAN_N_TX_BCF_CF5_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF5 */
#define IFX_CAN_N_TX_BCF_CF5_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF5 */
#define IFX_CAN_N_TX_BCF_CF5_OFF (5u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF6 */
#define IFX_CAN_N_TX_BCF_CF6_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF6 */
#define IFX_CAN_N_TX_BCF_CF6_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF6 */
#define IFX_CAN_N_TX_BCF_CF6_OFF (6u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF7 */
#define IFX_CAN_N_TX_BCF_CF7_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF7 */
#define IFX_CAN_N_TX_BCF_CF7_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF7 */
#define IFX_CAN_N_TX_BCF_CF7_OFF (7u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF8 */
#define IFX_CAN_N_TX_BCF_CF8_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF8 */
#define IFX_CAN_N_TX_BCF_CF8_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF8 */
#define IFX_CAN_N_TX_BCF_CF8_OFF (8u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF9 */
#define IFX_CAN_N_TX_BCF_CF9_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF9 */
#define IFX_CAN_N_TX_BCF_CF9_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF9 */
#define IFX_CAN_N_TX_BCF_CF9_OFF (9u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF10 */
#define IFX_CAN_N_TX_BCF_CF10_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF10 */
#define IFX_CAN_N_TX_BCF_CF10_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF10 */
#define IFX_CAN_N_TX_BCF_CF10_OFF (10u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF11 */
#define IFX_CAN_N_TX_BCF_CF11_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF11 */
#define IFX_CAN_N_TX_BCF_CF11_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF11 */
#define IFX_CAN_N_TX_BCF_CF11_OFF (11u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF12 */
#define IFX_CAN_N_TX_BCF_CF12_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF12 */
#define IFX_CAN_N_TX_BCF_CF12_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF12 */
#define IFX_CAN_N_TX_BCF_CF12_OFF (12u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF13 */
#define IFX_CAN_N_TX_BCF_CF13_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF13 */
#define IFX_CAN_N_TX_BCF_CF13_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF13 */
#define IFX_CAN_N_TX_BCF_CF13_OFF (13u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF14 */
#define IFX_CAN_N_TX_BCF_CF14_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF14 */
#define IFX_CAN_N_TX_BCF_CF14_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF14 */
#define IFX_CAN_N_TX_BCF_CF14_OFF (14u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF15 */
#define IFX_CAN_N_TX_BCF_CF15_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF15 */
#define IFX_CAN_N_TX_BCF_CF15_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF15 */
#define IFX_CAN_N_TX_BCF_CF15_OFF (15u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF16 */
#define IFX_CAN_N_TX_BCF_CF16_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF16 */
#define IFX_CAN_N_TX_BCF_CF16_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF16 */
#define IFX_CAN_N_TX_BCF_CF16_OFF (16u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF17 */
#define IFX_CAN_N_TX_BCF_CF17_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF17 */
#define IFX_CAN_N_TX_BCF_CF17_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF17 */
#define IFX_CAN_N_TX_BCF_CF17_OFF (17u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF18 */
#define IFX_CAN_N_TX_BCF_CF18_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF18 */
#define IFX_CAN_N_TX_BCF_CF18_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF18 */
#define IFX_CAN_N_TX_BCF_CF18_OFF (18u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF19 */
#define IFX_CAN_N_TX_BCF_CF19_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF19 */
#define IFX_CAN_N_TX_BCF_CF19_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF19 */
#define IFX_CAN_N_TX_BCF_CF19_OFF (19u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF20 */
#define IFX_CAN_N_TX_BCF_CF20_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF20 */
#define IFX_CAN_N_TX_BCF_CF20_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF20 */
#define IFX_CAN_N_TX_BCF_CF20_OFF (20u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF21 */
#define IFX_CAN_N_TX_BCF_CF21_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF21 */
#define IFX_CAN_N_TX_BCF_CF21_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF21 */
#define IFX_CAN_N_TX_BCF_CF21_OFF (21u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF22 */
#define IFX_CAN_N_TX_BCF_CF22_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF22 */
#define IFX_CAN_N_TX_BCF_CF22_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF22 */
#define IFX_CAN_N_TX_BCF_CF22_OFF (22u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF23 */
#define IFX_CAN_N_TX_BCF_CF23_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF23 */
#define IFX_CAN_N_TX_BCF_CF23_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF23 */
#define IFX_CAN_N_TX_BCF_CF23_OFF (23u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF24 */
#define IFX_CAN_N_TX_BCF_CF24_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF24 */
#define IFX_CAN_N_TX_BCF_CF24_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF24 */
#define IFX_CAN_N_TX_BCF_CF24_OFF (24u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF25 */
#define IFX_CAN_N_TX_BCF_CF25_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF25 */
#define IFX_CAN_N_TX_BCF_CF25_MSK (0x1u)

